In [27]:
import pandas as pd

In [28]:
# Sample dataset
data = {'Name': ['Alice', 'Bob', 'Charlie', 'Aman'],
'Age': [25, 30, None, 28],
'Salary': [50000, None, 45000, 52000]}
df = pd.DataFrame(data)

In [29]:
df

      Name   Age   Salary
0    Alice  25.0  50000.0
1      Bob  30.0      NaN
2  Charlie   NaN  45000.0
3     Aman  28.0  52000.0

In [31]:
# Fill missing values with mean
df['Age'].fillna(df['Age'].mean())

0    25.000000
1    30.000000
2    27.666667
3    28.000000
Name: Age, dtype: float64

In [32]:
df

      Name        Age   Salary
0    Alice  25.000000  50000.0
1      Bob  30.000000      NaN
2  Charlie  27.666667  45000.0
3     Aman  28.000000  52000.0